In [47]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
import math

In [48]:
df = pd.read_csv(r'C:/Users/Venom/Desktop/694560_1215964_bundle_archive/preprocessed_data.csv')

In [49]:
df.head()

,Region,Country,City,Month,Day,Year,AvgTemperature,Latitude,Longitude,dist_from_north,dist_from_south,Date
0,Africa,Algeria,Algiers,1,1,1995,64.2,36.775361,3.060188,5681.128030,14295.190776,1995-01-01
1,Asia,India,Bombay (Mumbai),1,1,1995,71.8,18.938771,72.835335,6866.138885,11252.200175,1995-01-01
2,North America,US,Dallas Ft Worth,1,1,1995,40.5,32.737242,-97.232572,7403.248687,14586.710516,1995-01-01
3,North America,US,Lansing,1,1,1995,30.2,42.733771,-84.555380,6246.804384,15777.536911,1995-01-01
4,Middle East,Turkey,Ankara,1,1,1995,46.2,39.920777,32.854067,4854.033455,14110.385731,1995-01-01

In [50]:
city_agg = pd.DataFrame()

In [51]:
city_agg['City'] = df.City.unique()

In [52]:
city_agg['Longitude'] = city_agg['City'].map(df.groupby('City').apply(lambda x:x.Longitude.unique()[0]).to_dict())

In [53]:
city_agg['dist_from_north'] = city_agg['City'].map(df.groupby('City').apply(lambda x:x.dist_from_north.unique()[0]).to_dict())

In [54]:
df['days_rolling_mean'] = df.groupby('City')['AvgTemperature'].rolling(30).mean().reset_index(0,drop=True)
rolling_mean_mapper = df.groupby('City').days_rolling_mean.mean().to_dict()
city_agg['days_rolling_mean'] = city_agg['City'].map(rolling_mean_mapper)

In [55]:
df['years_rolling_mean'] = df.groupby('City')['AvgTemperature'].rolling(365).mean().reset_index(0,drop=True)
rolling_mean_mapper = df.groupby('City').years_rolling_mean.mean().to_dict()
city_agg['years_rolling_mean'] = city_agg['City'].map(rolling_mean_mapper)

In [56]:
df['is_neg_percent'] = np.where(df.AvgTemperature<0,1,0)
neg_mapper = df.groupby('City').apply(lambda x:x.is_neg_percent.mean()*100).to_dict()
city_agg['is_neg_percent'] = city_agg['City'].map(neg_mapper)

In [57]:
ymd_agg = pd.DataFrame()

In [58]:
ymd_agg = df[['City','Year','Month','Day','AvgTemperature']]

In [59]:
df['Season'] = (df.Month%12 + 3)//3

In [67]:
df['combined'] = df.City.astype(str)+"_"+df.Season.astype(str)
city_season_details = df.groupby(['combined']).AvgTemperature.mean().to_dict()

In [68]:
outlist = list(set(zip(df.City, df.Season)))
city_season_agg = pd.DataFrame(data=outlist, columns=['City','Season'])

In [70]:
city_season_agg['combined'] = city_season_agg.City.astype(str)+"_"+city_season_agg.Season.astype(str)
city_season_agg['city_season_mean'] = city_season_agg.combined.map(city_season_details)

In [73]:
city_season_agg.drop('combined',axis = 1, inplace=True)

In [76]:
df['combined'] = df.City.astype(str)+"_"+df.Month.astype(str)
city_month_details = df.groupby(['combined']).AvgTemperature.mean().to_dict()
outlist = list(set(zip(df.City, df.Month)))
city_month_agg = pd.DataFrame(data=outlist, columns=['City','Month'])
city_month_agg['combined'] = city_month_agg.City.astype(str)+"_"+city_month_agg.Month.astype(str)
city_month_agg['city_month_mean'] = city_month_agg.combined.map(city_month_details)
city_month_agg.drop('combined',axis = 1, inplace=True)

In [80]:
city_agg.head()

,City,Longitude,dist_from_north,days_rolling_mean,years_rolling_mean,is_neg_percent
0,Algiers,3.060188,5681.128030,64.486704,64.463481,0.000000
1,Bombay (Mumbai),72.835335,6866.138885,82.124008,82.120903,0.000000
2,Dallas Ft Worth,-97.232572,7403.248687,67.120178,67.116506,0.000000
3,Lansing,-84.555380,6246.804384,48.608459,48.594050,0.164871
4,Ankara,32.854067,4854.033455,51.564357,51.520532,0.000000

In [81]:
ymd_agg.head()

              City  Year  Month  Day  AvgTemperature
0          Algiers  1995      1    1            64.2
1  Bombay (Mumbai)  1995      1    1            71.8
2  Dallas Ft Worth  1995      1    1            40.5
3          Lansing  1995      1    1            30.2
4           Ankara  1995      1    1            46.2

In [82]:
city_season_agg.head()

             City  Season  city_season_mean
0  Corpus Christi       2         72.444014
1        Honolulu       1         74.056114
2        Montreal       1         19.952665
3         Dusanbe       4         60.870976
4            Riga       4         45.842952

In [85]:
city_month_agg.head()

              City  Month  city_month_mean
0   Corpus Christi      2        61.210765
1  Dallas Ft Worth      7        86.090710
2         Honolulu      1        73.563307
3       Wilmington      9        68.390566
4   Salt Lake City      7        81.112258

In [86]:
city_agg.to_csv(r'C:\Users\Venom\Desktop\694560_1215964_bundle_archive\agg\city_agg.csv',index=False)
ymd_agg.to_csv(r'C:\Users\Venom\Desktop\694560_1215964_bundle_archive\agg\ymd_agg.csv',index=False)
city_month_agg.to_csv(r'C:\Users\Venom\Desktop\694560_1215964_bundle_archive\agg\city_month_agg.csv',index=False)
city_season_agg.to_csv(r'C:\Users\Venom\Desktop\694560_1215964_bundle_archive\agg\city_season_agg.csv',index=False)